import { Link } from "react-router";
import angleRightIcon from "../assets/icons/angle-right.svg";

import "./RulesPage.css";

const RulesPage = () => {
  return (
    <main className="rules-page">
      <Link
        to="/"
        className="back-icon"
        title="חזרה"
      >
        <img src={angleRightIcon} alt="חזרה" />
      </Link>

    <section className="rules-card">
        <h1>תקנון הרשמה</h1>

        <h2>1. הרשמה</h2>

        <p>
            ההרשמה לחוג מתבצעת דרך האתר ומקום בשיעור נשמר
            לאחר השלמת תהליך ההרשמה.
        </p>

        <h2>2. תשלום</h2>

        <p>
            התשלום מתבצע בהתאם למחיר המוצג באתר בזמן ההרשמה.
            התשלום הינו לשיעור יחיד.
        </p>

        <h2>3. ביטול הרשמה</h2>

        <p>
            לא יינתן החזר כספי עבור ביטול הרשמה.
        </p>

        <p>
            במקרה של ביטול, ניתן להירשם לשיעור אחר בכפוף
            למקומות פנויים. מקום חלופי אינו מובטח.
        </p>

        <h2>4. הגעה לשיעור</h2>

        <p>
            יש להגיע בזמן ובבגדי ספורט מתאימים.
            במקרה של איחור משמעותי, ייתכן שלא ניתן יהיה
            להצטרף לשיעור.
        </p>

        <h2>5. התנהלות ובטיחות</h2>

        <p>
            יש להקשיב להנחיות הצוות, לשמור על ציוד הסטודיו
            ולהתייחס בכבוד לילדים ולצוות.
        </p>

        <p>
            באחריות ההורה לעדכן את הסטודיו מראש לגבי מגבלה
            רפואית, אלרגיה או מידע חשוב אחר הנוגע לילד.
        </p>

        <h2>6. ביטול שיעור מצד הסטודיו</h2>

        <p>
            במקרה של ביטול שיעור מצד הסטודיו, תימסר הודעה
            להורים ותינתן אפשרות מתאימה בהתאם לנסיבות.
        </p>

        <h2>7. אישור התקנון</h2>

        <p>
            ביצוע הרשמה לחוג מהווה אישור לכך שההורה קרא
            את התקנון ומסכים לתנאיו.
        </p>
    </section>
    </main>
  );
};

export default RulesPage;